test_data = {
    "flights": {
        "1": {
            "flight_taxes": {
                "airport_taxes_departure": {
                    "group_1": {
                        "Керосин": 83919.00,
                        "Обеспечение ГСМ": 0.00
                    },
                    "group_2": {
                        "Сбор за взлет/посадку": 715.00,
                        "Сбор за авиабезопасность": 515.00,
                        "АНО в зоне аэродрома": 255.50
                    },
                    "group_3": {
                        "АНО по трассе": 716.70
                    },
                    "group_4_1": {
                        "Ожидание в аэропорте прилета, часов": 1767.83
                    },
                    "group_4_2": {
                        "Ожидание в аэропорте прилета, дней": 0.00
                    },
                    # "group_5": {
                    #     "Проживание": ""
                    # },
                    "group_6": {
                        "Сбор за пользование аэровокзала": 50.00
                    },
                    "group_7": {
                        # "Бортпитание экипажа": "",
                        "Мед. обсл. экипажа": 490.00
                    },
                    "group_8": {
                        "Жидкость ИМ": 403.00
                    },
                    "group_9": {
                        "Прием/выпуск ВС": 0.00,
                        "Заправка питьевой водой ВС": 16250.00,
                        "Уборка ВС": 0.00,
                        "Обслуживание санузлов": 18935.00,
                        "Трап (посадка /высадка)": 18495.00,
                        "Буксировка ВС": 25550.00,
                        "Водило буксировочное": 2600.00,
                        "Воздушный запуск ВС": 110535.00,
                        "Открытие/ закрытие багажных люков": 0.00,
                        "Стремянка": 0.00,
                        "Очистка от снега с ПОЖ": 91640.00,
                        "Доставка экипажа к/от ВС": 0.00,
                        # "Наземное обслуживание": "",
                        "Доставка Бортпитания": 0.00
                    },
                    "group_10": {
                        "Доставка пассажиров к/от ВС": 8790.00
                    }
                },
                "airport_taxes_arrival": {
                    "group6": {
                        "Сбор за пользование аэровокзала": 50.00
                    },
                    "group_9": {
                        "Уборка ВС": 0.00,
                        "Обслуживание санузлов": 18935.00,
                        "Трап (посадка /высадка)": 18495.00,
                        "Открытие/ закрытие багажных люков": 0.00,
                        "Доставка экипажа к/от ВС": 0.00
                    },
                    "group_10": {
                        "Доставка пассажиров к/от ВС": 8790.00
                    }
                },
                "business_taxes": {
                    "Плановый налет": 18838.00,
                    "Заработная плата  летного состава и бортпроводников (переменная часть)": 210104724.99,
                    "Технические резервы (переменная часть)": 0.00,
                    "Прочие переменные расходы (бортпитание, трансфер,гостиница, командировки, агенты)": 256598237.67,
                    "Лизинг": 1289245180.67,
                    "Поддержание летной годности": 1680970444.43,
                    "Заработная плата": 1085490826.73,
                    "Технические резервы (постоянная часть)": 0.00,
                    "Страхование и таможенные платежи": 186665340.99,
                    "Амортизация и износ": 492072172.22,
                    "Прочие производственные (обучение, медосмотр,  представители, COVID и т.д.)": 275294712.00,
                    "Общехозяйственные расходы (коммунальные, связь, интернет, оргтехника, автотранспорт, вознаграждение членам СД)": 243743719.66,
                    "Внереализационные расходы (аренда кроме ВС, % к уплате, штрафы, пени, курсовые разницы, акцизы, бух операции)": 67338560.37,
                    "Распределяемые расходы (Ангар)": 0.00
                }
            },
            "flight_params": {
                "Дата выполнения рейса": "12.02.2025",
                "Тип рейса": "Рейс",
                "Тип ВС": "RRJ-95",
                "Аэропорт вылета": "РЩН",
                "Аэропорт прилета": "ДМД",
                "Загрузка пассажиров, чел.": 45.00,
                "Итого расстояние, км": 880.165,
                "Расстояние за границей, км": 132.4,
                "Налет, часов": 56.671,
                "Расход топлива, тонн": 6.518,
                "Ожидание в аэропорте прилета, дней": 4.00,
                "Ожидание в аэропорте прилета, часов": 4.00,
                "Борт. Питание": "Эконом",
                "Бизнес зал": "Нет"
            }
        }
    },
    "route_params": {
        "coefficient": 1
    },
    ""
}